app/controllers/login_controller.rb

  def create
    # raise request.env["omniauth.auth"].to_yaml
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 23 Mar 2013 14:00:57 UTC +00:00], ["name", "RENATO"], ["provider", "twitter"], ["uid", "1279279627"], ["updated_at", Sat, 23 Mar 2013 14:00:57 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '1279279627' LIMIT 1